tutorials/counterFlowFlame2D/constant/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      initialConditions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 0-D chemistry test point for chemFoam, built from this case's own
// conditions: p matches constant/../0.orig/p (1e5 Pa). T=1300K is a standard
// CH4/air shock-tube ignition-delay condition (ms-scale ignition delay at
// this p) - chosen so the induction -> chain-branching -> ignition
// transient actually happens within a runnable simulated time, unlike the
// cold 293 K boundary value (CH4 does not autoignite anywhere near 293 K on
// any practical timescale - its autoignition temperature is ~850 K) or the
// hot 2000 K pilot value (already close to/at equilibrium, little left to
// see - the same reasoning that applied to the GPU H2/O2 case earlier: it
// showed near-zero derivatives once already this hot). Edit T freely to
// probe other regimes - e.g. 293 for "nothing happens" cold reactants, or
// 2000 to match the case's internal-field pilot temperature.
//
// Composition: stoichiometric CH4/air, from
//   CH4 + 2(O2 + 3.76 N2) -> CO2 + 2 H2O + 7.52 N2
// i.e. mole ratio CH4 : O2 : N2 = 1 : 2 : 7.52 (dry air, 21/79 O2/N2 by mole).

constantProperty    pressure;

fractionBasis       mole;

p                   1e5;

T                   1300;

fractions
{
    CH4     1;
    O2      2;
    N2      7.52;
}

// ************************************************************************* //
